{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v3.3.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 1.0000001111620804e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8974305987358093, "scale": 0.0009999791781107584, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11023654119641173, "scale": 0.0009503150103138942, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07733597136011311, "scale": 0.0014591692709455303, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.024239184334874153, "scale": 0.0007601636224517635, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8716738820075989, "scale": 0.000465701608096852, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05152761116623878, "scale": 0.0005204809208710988, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5017613768577576, "scale": 0.008591895243700813, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 3.887263059616089, "scale": 0.10836343671761307, "original_dtype": "float32"}}, {"name": "conv2d/kernel", "shape": [5, 5, 1, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16416254908430808, "scale": 0.0012250936498828962, "original_dtype": "float32"}}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02504025165941201, "scale": 0.00021774131877749575, "original_dtype": "float32"}}, {"name": "conv2d_1/kernel", "shape": [5, 5, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15884137621112898, "scale": 0.0012409482516494452, "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04585479909882826, "scale": 0.0005152224617845872, "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21031794548034669, "scale": 0.0015464554814731374, "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12818654910022137, "scale": 0.0008779900623302833, "original_dtype": "float32"}}, {"name": "conv2d_3/kernel", "shape": [2, 2, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25547807356890506, "scale": 0.0018924301745844821, "original_dtype": "float32"}}, {"name": "conv2d_3/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09146201785872965, "scale": 0.0007258890306248385, "original_dtype": "float32"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 32, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1716243691304151, "scale": 0.001351372985278859, "original_dtype": "float32"}}, {"name": "conv2d_4/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05211183206707823, "scale": 0.00046528421488462707, "original_dtype": "float32"}}, {"name": "conv2d_5/kernel", "shape": [2, 2, 16, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.26629188721086466, "scale": 0.002002194640683193, "original_dtype": "float32"}}, {"name": "conv2d_5/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09008529037237167, "scale": 0.0002735109451939078, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [256, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18820093542921779, "scale": 0.0015056074834337422, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05203959068977366, "scale": 0.0003079265721288382, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [1024, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1500732141382554, "scale": 0.001339939411948709, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05335358475499293, "scale": 0.0003233550591211693, "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19391871334290972, "scale": 0.0014580354386684942, "original_dtype": "float32"}}, {"name": "dense_2/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.054621361108387216, "scale": 0.0004234214039409862, "original_dtype": "float32"}}, {"name": "dense_3/kernel", "shape": [256, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1992501707638011, "scale": 0.0016331981210147633, "original_dtype": "float32"}}, {"name": "dense_3/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.056471551750220506, "scale": 0.00038156453885284123, "original_dtype": "float32"}}, {"name": "dense_4/kernel", "shape": [64, 10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3219606724439883, "scale": 0.0024766205572614485, "original_dtype": "float32"}}, {"name": "dense_4/bias", "shape": [10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.052720821429701414, "scale": 0.00039940016234622284, "original_dtype": "float32"}}]}]}